In [1]:
import pandas as pd
cityD={'Population':10927986,'Hospitals':189,'Schools':7916}
cityM={'Population':12691836,'Hospitals':208,'Schools':8508}
cityK={'Population':4631392,'Hospitals':149,'Schools':7226}
cityC={'Population':4328063,'Hospitals':157,'Schools':7617}
cities=[cityD,cityM,cityK,cityC]
df5=pd.DataFrame(cities,index=["Delhi","Mumbai","Kolkata","Chennai"])
df5

         Population  Hospitals  Schools
Delhi      10927986        189     7916
Mumbai     12691836        208     8508
Kolkata     4631392        149     7226
Chennai     4328063        157     7617

# Adding/Modifying a Row

df.at['new_row_name',:]=new_value

df.loc['new_row_name',:]=new_value

In [2]:
df5.at['Bangalore',:]=[10002980,171,7311]      # make sure to add the respective  values w.r.t no of columns
df5                                            # just a single value will assign and will be given to all its columns.

           Population  Hospitals  Schools
Delhi      10927986.0      189.0   7916.0
Mumbai     12691836.0      208.0   8508.0
Kolkata     4631392.0      149.0   7226.0
Chennai     4328063.0      157.0   7617.0
Bangalore  10002980.0      171.0   7311.0

In [3]:
df5.loc['Hyderabad',:]=[10451120,263,9126]
df5

           Population  Hospitals  Schools
Delhi      10927986.0      189.0   7916.0
Mumbai     12691836.0      208.0   8508.0
Kolkata     4631392.0      149.0   7226.0
Chennai     4328063.0      157.0   7617.0
Bangalore  10002980.0      171.0   7311.0
Hyderabad  10451120.0      263.0   9126.0

Make sure that the sequence containing values for the new column must have values equal to no. of columns in the DF.

In [4]:
df5.loc['Hyderabad',:]=[10452980,291,9806]          # Modifying the existing row
df5

           Population  Hospitals  Schools
Delhi      10927986.0      189.0   7916.0
Mumbai     12691836.0      208.0   8508.0
Kolkata     4631392.0      149.0   7226.0
Chennai     4328063.0      157.0   7617.0
Bangalore  10002980.0      171.0   7311.0
Hyderabad  10452980.0      291.0   9806.0

# Adding/Modifying a Column

df.column_name=[new_values]

df[column_name]=[new_values]

df.at[:,'col_name']=[col_values]

df.loc[:,'col_name']=[col_values]

dft=df.assign('col_name'=[values_for_col])

In [5]:
df5['Density']=[1500,1219,1630,1050,1100,1360]         # make sure to add the respective values w.r.t no of rows
df5                                                    #just a single value will assign and will be given to all its rows.

           Population  Hospitals  Schools  Density
Delhi      10927986.0      189.0   7916.0     1500
Mumbai     12691836.0      208.0   8508.0     1219
Kolkata     4631392.0      149.0   7226.0     1630
Chennai     4328063.0      157.0   7617.0     1050
Bangalore  10002980.0      171.0   7311.0     1100
Hyderabad  10452980.0      291.0   9806.0     1360

For the existing column, it will change the data values and for non-existing column,
it will add a new column along with its new values.

Make sure that the sequence containing values for the new column must have values equal to no. of rows in the DF.

# Modifying a Single Cell/Single Data

df.iat[row_position,column_position]=new_value

df.col_name['row_name']=new_value

In [6]:
df5.Population['Bangalore']=5678097
df5

C:\Users\KISLAY~1\AppData\Local\Temp/ipykernel_8144/4208483896.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df5.Population['Bangalore']=5678097

           Population  Hospitals  Schools  Density
Delhi      10927986.0      189.0   7916.0     1500
Mumbai     12691836.0      208.0   8508.0     1219
Kolkata     4631392.0      149.0   7226.0     1630
Chennai     4328063.0      157.0   7617.0     1050
Bangalore   5678097.0      171.0   7311.0     1100
Hyderabad  10452980.0      291.0   9806.0     1360

In [7]:
df5

           Population  Hospitals  Schools  Density
Delhi      10927986.0      189.0   7916.0     1500
Mumbai     12691836.0      208.0   8508.0     1219
Kolkata     4631392.0      149.0   7226.0     1630
Chennai     4328063.0      157.0   7617.0     1050
Bangalore   5678097.0      171.0   7311.0     1100
Hyderabad  10452980.0      291.0   9806.0     1360

In [8]:
df5.iat[3,1]=192
df5

           Population  Hospitals  Schools  Density
Delhi      10927986.0      189.0   7916.0     1500
Mumbai     12691836.0      208.0   8508.0     1219
Kolkata     4631392.0      149.0   7226.0     1630
Chennai     4328063.0      192.0   7617.0     1050
Bangalore   5678097.0      171.0   7311.0     1100
Hyderabad  10452980.0      291.0   9806.0     1360

# Deleting/Renaming  Columns/Rows

del df['column_name']

df.drop(row_index or sequence of index)

In [9]:
del df5['Density']       #for deleting Column
df5

           Population  Hospitals  Schools
Delhi      10927986.0      189.0   7916.0
Mumbai     12691836.0      208.0   8508.0
Kolkata     4631392.0      149.0   7226.0
Chennai     4328063.0      192.0   7617.0
Bangalore   5678097.0      171.0   7311.0
Hyderabad  10452980.0      291.0   9806.0

In [10]:
df5.drop(["Kolkata","Chennai"],axis=0,inplace=True)  #'inplace' if True, makes changes in the original DF.
df5

           Population  Hospitals  Schools
Delhi      10927986.0      189.0   7916.0
Mumbai     12691836.0      208.0   8508.0
Bangalore   5678097.0      171.0   7311.0
Hyderabad  10452980.0      291.0   9806.0

df.rename(index={'old_name':'new_name'},column={'old_name':'new_name'},inplace=True)

Specify 'inplace' argument as 'True' if you want to rename the rows/columns in the same DF as if you skip this argument, 
then a new DF is created with new indexes & column names and original remains unchanged.

In [11]:
import pandas as pd
topperA={'Rollno':115,'Name':'Avni','Marks':97.5}          #keys of inner Dictionaries have made the columns of the DF
topperB={'Rollno':236,'Name':'Rishi','Marks':98}            
topperC={'Rollno':307,'Name':'Preet','Marks':98.5}         #values of the inner Dictionaries have made the rows of the DF
topperD={'Rollno':422,'Name':'Karan','Marks':98}
toppers=[topperA,topperB,topperC,topperD]           #---->list of dictionaries
topdf=pd.DataFrame(toppers,index=["SecA","SecB","SecC","SecD"])
topdf

      Rollno   Name  Marks
SecA     115   Avni   97.5
SecB     236  Rishi   98.0
SecC     307  Preet   98.5
SecD     422  Karan   98.0

In [12]:
topdf.rename(index={"SecA":"A","SecB":"B","SecC":"C","SecD":"D"},columns={"Rollno":"Rno"},inplace=True)
topdf

   Rno   Name  Marks
A  115   Avni   97.5
B  236  Rishi   98.0
C  307  Preet   98.5
D  422  Karan   98.0

By Default inplace argument is considered as False in Python.

# Boolean Indexing

Having Boolean values (True or False) or (1 or 0) as indexes of a DataFrame.
It basically divides the DataFrame in two groups True Rows and False Rows

In [13]:
import pandas as pd
Days=['Monday','Tuesday','Wednesday','Thursday','Friday']       #Creating DFs with Boolean Index (True or false)
Classes=[6,0,3,0,8]
dc={'Days':Days,'No. of Classes':Classes}
classDF=pd.DataFrame(dc,index=[True,False,True,False,True])
classDF

            Days  No. of Classes
True      Monday               6
False    Tuesday               0
True   Wednesday               3
False   Thursday               0
True      Friday               8

In [14]:
import pandas as pd
Days=['Monday','Tuesday','Wednesday','Thursday','Friday']       #Creating DFs with Boolean Index (1 or 0)
Classes=[6,0,3,0,8]
dc={'Days':Days,'No. of Classes':Classes}
classDF1=pd.DataFrame(dc,index=[1,0,1,0,1])
classDF1

        Days  No. of Classes
1     Monday               6
0    Tuesday               0
1  Wednesday               3
0   Thursday               0
1     Friday               8

Accessing Rows from DFs with Boolean Index

In [15]:
classDF.loc[True]

           Days  No. of Classes
True     Monday               6
True  Wednesday               3
True     Friday               8

In [16]:
classDF.loc[False]

           Days  No. of Classes
False   Tuesday               0
False  Thursday               0

In [17]:
classDF1.loc[1]

        Days  No. of Classes
1     Monday               6
1  Wednesday               3
1     Friday               8

In [18]:
classDF1.loc[0]

       Days  No. of Classes
0   Tuesday               0
0  Thursday               0